"""
标题：https://bbs.quantclass.cn/thread/68484
链接：【任务1】【ZZZZZ】小市值策略优化_121.12%_-47.94%_2.53
评价：
	亮点：这个log太直了，斜率很大，是我见过最直的，可以在此基础上魔改了
	缺点：
	15年回撤大小：
	22、23年涨跌：
	对数坐标轴斜率：
	RankIC表现：

整体表现：

"""

"""
邢不行™️选股框架
Python股票量化投资课程

版权所有 ©️ 邢不行
微信: xbx8662

未经授权，不得复制、修改、或使用本代码的全部或部分内容。仅限个人学习用途，禁止商业用途。

Author: 邢不行
"""
import os
from pathlib import Path
from config_file_path import *
# ====================================================================================================
# 1️⃣ 回测配置
# ====================================================================================================
# 回测数据的起始时间。如果因子使用滚动计算方法，在回测初期因子值可能为 NaN，实际的首次交易日期可能晚于这个起始时间。
start_date = "2009-01-01"
# 回测数据的结束时间。可以设为 None，表示使用最新数据；也可以指定具体日期，例如 '2024-11-01'。
end_date = None



# ====================================================================================================
# 3️⃣ 策略配置
# ====================================================================================================
strategy = {
    'name': '市值及布林带偏离度因子',
    'hold_period': '5D',
    'select_num': 10,
    "factor_list": [
        ('市值', True, None, 1),
        #('布林带宽', True, None, 2),
        ('布林带偏离度', True, None, 2),
        #('市盈率位置', True, [300], 1) # PE:名称，True:升序，['ttm', 300]: ttm: 全年pe_ttm, 300: 估值周期，1：权重为1

    ],
    "filter_list": [
        # ('交易所', None, 'val:<=3'),  # 1沪A 2深A 3创业板 4科创板 5北交所
        ('月份', [1, 4], 'val:!=1'),  # 不在1、4月份选股
        ('市值', None, 'pct:<0.2'),
        #('ROE', '单季', 'pct:<=0.8', False)
    ]}

days_listed = 250  # 上市至今交易天数
# excluded_boards = ["kcb", "bj"]  # 同时过滤创业板和科创板和北交所

# excluded_boards = ["bj"]  # 过滤板块，默认不过滤
excluded_boards = ["cyb", "kcb", "bj"]  # 同时过滤创业板和科创板和北交所


#equity_timing = {"name": "中证2000", "params": [[8, 2,0.7]]}
equity_timing = {"name": "移动平均线", "params": [20]}



# ====================================================================================================
# 4️⃣ 模拟交易配置
# 以下参数几乎不需要改动
# ====================================================================================================
initial_cash = 10_0000  # 初始资金10w
# initial_cash = 1_0000_0000  # 初始资金10w
# 手续费
c_rate = 1.2 / 10000
# 印花税
t_rate = 1 / 1000
# 并行运行的进程数
n_jobs = os.cpu_count() - 1

# =====参数预检查=====
if Path(stock_data_path).exists() is False:
    print(f"股票日线数据路径不存在：{stock_data_path}，请检查配置或联系助教，程序退出")
    exit()
if Path(index_data_path).exists() is False:
    print(f"指数数据路径不存在：{index_data_path}，请检查配置或联系助教，程序退出")
    exit()
