"""
标题：【任务1】【Roshan🐲430】基于市值和异常换手率过滤策略_54.19%_-37.79%_1.43
链接：https://bbs.quantclass.cn/thread/65549
评价：
	亮点：
	缺点：
	15年回撤大小：
	22、23年涨跌：
	对数坐标轴斜率：
	RankIC表现：

整体表现：

"""

import os
from pathlib import Path

# ====================================================================================================
# 1️⃣ 回测配置
# ====================================================================================================
# 回测数据的起始时间。如果因子使用滚动计算方法，在回测初期因子值可能为 NaN，实际的首次交易日期可能晚于这个起始时间。
start_date = "2015-01-01"
# 回测数据的结束时间。可以设为 None，表示使用最新数据；也可以指定具体日期，例如 '2024-11-01'。
end_date = "2025-08-07"

# ====================================================================================================
# 2️⃣ 数据配置
# ====================================================================================================
# 数据中心的文件夹，使用数据客户端，并订阅相关数据，就不需要再手动指定每一个必要数据
data_center_path = Path(r"/Users/wangminli/我的文档/Quant/邢不行量化课程-付费/下载数据/")

# 数据源的定义，如果不使用数据客户端的时候，可以手动自定义以下逐个数据源
# ** 股票日线数据 和 指数数据是必须的，其他的数据可以在 data_sources 中定义 **
# (必选) 股票日线数据，全量数据下载链接：https://www.quantclass.cn/data/stock/stock-trading-data
# 参考：https://bbs.quantclass.cn/thread/39599
# (必选) 股票日线数据，全量数据下载链接：https://www.quantclass.cn/data/stock/stock-trading-data
stock_data_path = data_center_path / r"stock-trading-data-pro-2025-08-07"  # 参考：https://bbs.quantclass.cn/thread/39599
# (必选) 指数数据路径，全量数据下载链接：https://www.quantclass.cn/data/stock/stock-main-index-data
index_data_path = data_center_path /r"stock-main-index-data-2025-08-06"
# (可选) 财务数据，全量数据下载链接：https://www.quantclass.cn/data/stock/stock-fin-data-xbx
fin_data_path =data_center_path / r"stock-fin-data-xbx-2025-08-07"



# ====================================================================================================
# 3️⃣ 策略配置
# ====================================================================================================

strategy = {
    'name': '换手率小市值过滤',  # 策略名
    'hold_period': '3D',  # 持仓周期，W 代表周，M 代表月，还支持日频：3D、5D、10D
    'select_num': 10,  # 选股数量，可以是整数，也可以是小数，比如 0.1 表示选取 10% 的股票
    "factor_list": [  # 选股因子列表
        # ('振幅', True, 90, 5),
        # ('成交额缩量因子', True, (5, 30), 1),
        # ('成交额缩波因子', True, (5, 30), 1),
        # ('Ret', True, 5, 1),
        ('窗口最高价比值', True, 120, 1),
        # ('市值', True, None, 1),
        # ('回撤', False, 3, 1),
    ],
    "filter_list": [
        # ('收盘价', '', 'val:>=5'),
        ('市值', None, 'pct:<0.1'),
        # ('MACD底背离修改', True, 'val:==1'),
        ('窗口最低价比值', 120, 'pct:>=0.2'),  # 排除60天接近最低价区间（连跌）
        ('异常高换手率过滤', 10, 'val:==0'),  # 使用10日窗口，排除因子值为1的股票

        # ('X光脚阴线', 0, 'val:!=1'),
    ]  # 过滤因子列表
}

days_listed = 250  # 上市至今交易天数

excluded_boards = ["cyb", "kcb", "bj"]  # 同时过滤创业板和科创板和北交所

# equity_timing = {"name": "万得微盘股PB"}
# equity_timing = {"name": "万得微盘股PB"}



# ====================================================================================================
# 4️⃣ 模拟交易配置
# 以下参数几乎不需要改动
# ====================================================================================================
initial_cash = 10_0000  # 初始资金10w
# initial_cash = 1_0000_0000  # 初始资金10w
# 手续费
c_rate = 1.2 / 10000
# 印花税
t_rate = 1 / 1000
# 并行运行的进程数
n_jobs = os.cpu_count() - 1

# =====参数预检查=====
if Path(stock_data_path).exists() is False:
    print(f"股票日线数据路径不存在：{stock_data_path}，请检查配置或联系助教，程序退出")
    exit()
if Path(index_data_path).exists() is False:
    print(f"指数数据路径不存在：{index_data_path}，请检查配置或联系助教，程序退出")
    exit()
