"""
缺少micro_cap_index_pb.csv
"""

"""
邢不行™️选股框架
Python股票量化投资课程

版权所有 ©️ 邢不行
微信: xbx8662

未经授权，不得复制、修改、或使用本代码的全部或部分内容。仅限个人学习用途，禁止商业用途。

Author: 邢不行
"""
import os
from pathlib import Path
from config_file_path import *
# ====================================================================================================
# 1️⃣ 回测配置
# ====================================================================================================
# 回测数据的起始时间。如果因子使用滚动计算方法，在回测初期因子值可能为 NaN，实际的首次交易日期可能晚于这个起始时间。
start_date = "2016-01-01"
# 回测数据的结束时间。可以设为 None，表示使用最新数据；也可以指定具体日期，例如 '2024-11-01'。
end_date = None



# ====================================================================================================
# 3️⃣ 策略配置
# ====================================================================================================
strategy = {
    'name': 'PB择时策略',  # 策略名
    'hold_period': '3D',  # 持仓周期，W 代表周，M 代表月，还支持日频：3D、5D、10D
    'select_num': 3,  # 选股数量，可以是整数，也可以是小数，比如 0.1 表示选取 10% 的股票
    "factor_list": [  # 选股因子列表
        ('振幅', True, 90, 5),
        ('成交额缩波因子', True, (10, 60), 1),
        ('Ret', True, 5, 2),
        ('回撤', False, 3, 1),
    ],
    "filter_list": [
        # ('收盘价', '', 'val:>=3'),
        ('市值', '', 'val:<=3e9', None),
        ('X光脚阴线', 0, 'val:!=1'),
        ('MACD底背离修改', True, 'val:==1'),
        # ('月份', [1, 4], 'val:!=1'),
    ]  # 过滤因子列表
}

days_listed = 250  # 上市至今交易天数

excluded_boards = ["cyb", "kcb", "bj"]  # 同时过滤创业板和科创板和北交所

equity_timing = {"name": "万得微盘股PB"}

# ====================================================================================================
# 4️⃣ 模拟交易配置
# 以下参数几乎不需要改动
# ====================================================================================================
initial_cash = 100_0000  # 初始资金10w
# 手续费
c_rate = 1.2 / 10000
# 印花税
t_rate = 1 / 1000
# 并行运行的进程数
n_jobs = os.cpu_count() - 1

# =====参数预检查=====
if Path(stock_data_path).exists() is False:
    print(f"股票日线数据路径不存在：{stock_data_path}，请检查配置或联系助教，程序退出")
    exit()
if Path(index_data_path).exists() is False:
    print(f"指数数据路径不存在：{index_data_path}，请检查配置或联系助教，程序退出")
    exit()
